k-omura/STM32-synthesizer/Drivers/stm32_synth/components/stm32_synth_chord.c
/*
 * stm32_synth_chord.c
 *
 *  Created on: Feb 11, 2024
 *      Author: k-omura
 */

#include <stdint.h>

#include "stm32_synth.h"
#include "components/stm32_synth_component.h"
#include "components/stm32_synth_midi.h"
#include "components/stm32_synth_fastmath.h"

//
#define STM32SYNTH_COMPONENT_CHORD_DISABLEDNN 0xFFFF //!< if note num is this, chord is disabled

#ifdef STM32SYNTH_I2S
#define STM32SYNTH_CHORD_BASE_AMP_SHIFT 6 //!< if I2S, 6bit shift to use whole range of amp. (12bit->6bit, 16bit->10bit)
#else
#define STM32SYNTH_CHORD_BASE_AMP_SHIFT 7 //!< if not I2S, 7bit shift to use whole range of amp. (12bit->5bit)
#endif
#define STM32SYNTH_CHORD_BASE_AMP (STM32SYNTH_GND_LEVEL >> STM32SYNTH_CHORD_BASE_AMP_SHIFT)              //!< base amp for chord, shift to use whole range of amp. (12bit->5bit)
#define STM32SYNTH_CHORD_DISTORTION_SHIFT (STM32SYNTH_AMP_MAX_BIT - STM32SYNTH_CHORD_BASE_AMP_SHIFT - 7) //!< distortion shift, 7bit for distortion curve (127->7bit)

#define STM32SYNTH_CHORD_DRUM_TYPE_SIN (0b00000001)   //!< if this bit is 1, add sine wave to drum chord
#define STM32SYNTH_CHORD_DRUM_TYPE_SQU (0b00000010)   //!< if this bit is 1, add square wave to drum chord
#define STM32SYNTH_CHORD_DRUM_TYPE_TRI (0b00000100)   //!< if this bit is 1, add triangle wave to drum chord
#define STM32SYNTH_CHORD_DRUM_TYPE_NOISE (0b00001000) //!< if this bit is 1, add noise to drum chord

// private functions
#ifdef STM32SYNTH_I2S
stm32synth_res_t stm32synth_chord_updateChord(stm32synth_config_t *_config, stm32synth_chord_t *_configChord, q15_t *_pbuffL, q15_t *_pbuffR);
#else
stm32synth_res_t stm32synth_chord_updateChord(stm32synth_config_t *_config, stm32synth_chord_t *_configChord, q15_t *_pbuff);
#endif
stm32synth_res_t stm32synth_chord_adsrCurve(stm32synth_config_t *_config, stm32synth_chord_t *_configChord, float32_t *_amp);
stm32synth_res_t stm32synth_chord_envelope(stm32synth_config_envelopec_t *_envelopec, uint32_t *_envelopeCount, int16_t *_outval);

stm32synth_res_t stm32synth_chord_makerad(stm32synth_chord_t *_configChord, uint16_t _nn, q15_t *_radBuff, stm32synth_waveformnum_t _wnum);
stm32synth_res_t stm32synth_chord_addsine(stm32synth_config_t *_config, stm32synth_chord_t *_configChord, q15_t *_chordBuff, q15_t *_radBuff, stm32synth_waveformnum_t _wnum);
stm32synth_res_t stm32synth_chord_addsque(stm32synth_config_t *_config, stm32synth_chord_t *_configChord, q15_t *_chordBuff, q15_t *_radBuff, stm32synth_waveformnum_t _wnum);
stm32synth_res_t stm32synth_chord_addtrgl(stm32synth_config_t *_config, stm32synth_chord_t *_configChord, q15_t *_chordBuff, q15_t *_radBuff, stm32synth_waveformnum_t _wnum);
stm32synth_res_t stm32synth_chord_addnoise(stm32synth_config_t *_config, float32_t _amp, q15_t *_chordBuff);
float32_t stm32synth_chord_exp_neg2_ratio(uint32_t _count, uint32_t _time_ms);

// private variables
static stm32synth_chord_t chords[STM32SYNTH_MAX_CHORD];

#ifndef STM32SYNTH_DRUM_TESTMODE
static const stm32synth_config_drum_t drumConfigList[STM32SYNTH_DRUMCHORD_NUMBER];
#else
static stm32synth_config_drum_t drumConfigList[STM32SYNTH_DRUMCHORD_NUMBER];
#endif /* STM32SYNTH_DRUM_TESTMODE */

#ifdef STM32SYNTH_SIN_CORDIC
// CORDIC instance, config
static CORDIC_HandleTypeDef *cordicHW;
#else
// sine look up table
static const q15_t sine_lut[1024]; //<! sine look up table 1024 samples for one cycle, full range of q15_t (0 to 32767 to -32768 to 0)
#endif /* STM32SYNTH_SIN_CORDIC */

static const float32_t exp_neg2_table[257]; //<! exp(-2 * x) table for x=0 to 1, 256 steps, used for ADSR curve

// Audio rendering is serialized by the DMA half/full callbacks, so these buffers can be shared.
static q15_t chordScratch[STM32SYNTH_HALF_NUM_SAMPLING];
static q15_t phaseScratch[STM32SYNTH_HALF_NUM_SAMPLING];
static q15_t tempScratch[STM32SYNTH_HALF_NUM_SAMPLING];
#ifdef STM32SYNTH_REVERB
static uint8_t reverbReadIndex;
#endif /* STM32SYNTH_REVERB */

/**
 * @brief Test the chord component by generating a test chord and sending it to the synthesizer.
 *
 * @param _config
 * @return stm32synth_res_t
 */
stm32synth_res_t stm32synth_component_testChord(stm32synth_config_t *_config)
{
    stm32synth_res_t res = STM32SYNTH_RES_OK;

    stm32synth_chord_t testChord;

    // test para
    testChord.channel = 0;
    testChord.noteNum[0] = 72 << 8;
    testChord.velocity = 10;

    stm32synth_component_noteonChord(_config, &testChord);

    return res;
}

/**
 * @brief Initialize the chord component by setting up the chord structures and drum configurations.
 *
 * @return stm32synth_res_t
 */
stm32synth_res_t stm32synth_component_initChord()
{
    stm32synth_res_t res = STM32SYNTH_RES_OK;

    for (uint8_t cc = 0; cc < STM32SYNTH_MAX_CHORD; cc++)
    {
        chords[cc].rad[STM32SYNTH_WAVEFORM_0] = 0;
        chords[cc].rad[STM32SYNTH_WAVEFORM_1] = 0;
        chords[cc].noteNum[0] = STM32SYNTH_COMPONENT_CHORD_DISABLEDNN;
        chords[cc].adsr.count = 0;
        chords[cc].adsr.state = STM32SYNTH_ADSRSTATE_WAIT;
        chords[cc].envelope.volume = 0;
        chords[cc].envelope.freq = 0;
#ifdef STM32SYNTH_FILTER
        chords[cc].envelope.cutoff = 0;

#ifdef STM32SYNTH_FILT_CMSIS
        stm32synth_component_initFilter(&chords[cc].lpf);
        stm32synth_component_initFilter(&chords[cc].hpf);
#endif /* STM32SYNTH_FILT_CMSIS */

        if (chords[cc].channel != STM32SYNTH_MIDINN_DRUMCH)
        {
            chords[cc].lpf.para.q_factor = 0.8f;
            chords[cc].hpf.para.q_factor = 0.8f;
            chords[cc].lpf.para.cutoff_freq_nn.absolute = 127 << 8;
            chords[cc].hpf.para.cutoff_freq_nn.absolute = 127 << 8;
            stm32synth_component_updateLPF(&chords[cc].lpf, 0);
            stm32synth_component_updateHPF(&chords[cc].hpf, 0);
        }
#endif
    }

#ifdef STM32SYNTH_DRUM_TESTMODE
    stm32synth_drum_init();
#endif /* STM32SYNTH_DRUM_TESTMODE */

    return res;
}

/**
 * @brief Handle a note-on event for a chord. This function searches for an available chord slot and initializes it with the provided chord parameters.
 *
 * @param _config
 * @param _inpurChord
 * @return stm32synth_res_t
 */
stm32synth_res_t stm32synth_component_noteonChord(stm32synth_config_t *_config, stm32synth_chord_t *_inpurChord)
{
    stm32synth_res_t res = STM32SYNTH_RES_NG;

    for (uint8_t cc = 0; cc < STM32SYNTH_MAX_CHORD; cc++)
    {
        if (
            ((chords[cc].channel == _inpurChord->channel) && (chords[cc].noteNum[0] == _inpurChord->noteNum[0])) || // comment out if computational resources are sufficient.
            (chords[cc].adsr.state == STM32SYNTH_ADSRSTATE_WAIT) ||
            (_config->phonic[_inpurChord->channel] == STM32SYNTH_PHONIC_MONO) ||
            (_config->phonic[_inpurChord->channel] == STM32SYNTH_PHONIC_MONO_SUSTON))
        {
            chords[cc].channel = _inpurChord->channel;
            chords[cc].noteNum[0] = _inpurChord->noteNum[0];
            chords[cc].noteNum[1] = 0;
            chords[cc].velocity = _inpurChord->velocity;

            chords[cc].adsr.state = STM32SYNTH_ADSRSTATE_ATTACK;
            chords[cc].adsr.count = 0;
            chords[cc].rad[STM32SYNTH_WAVEFORM_0] = 0;
            chords[cc].rad[STM32SYNTH_WAVEFORM_1] = 0;
            chords[cc].envelope.volume = 0;
            chords[cc].envelope.freq = 0;
#ifdef STM32SYNTH_FILTER
            chords[cc].envelope.cutoff = 0;
#endif

            if (chords[cc].channel == STM32SYNTH_MIDINN_DRUMCH)
            {
                // filter
                uint8_t drumConfigIndex = (chords[cc].noteNum[0] >> 8);
                drumConfigIndex = (drumConfigIndex < STM32SYNTH_MIDINN_LOWESTDRUM) ? (STM32SYNTH_MIDINN_LOWESTDRUM) : (drumConfigIndex);
                drumConfigIndex = (STM32SYNTH_MIDINN_HIGHESTDRUM < drumConfigIndex) ? (STM32SYNTH_MIDINN_HIGHESTDRUM) : (drumConfigIndex);
                drumConfigIndex -= STM32SYNTH_MIDINN_LOWESTDRUM;
                chords[cc].noteNum[1] = drumConfigIndex;

                chords[cc].lpf.para.q_factor = drumConfigList[drumConfigIndex].lpfq;
                chords[cc].hpf.para.q_factor = drumConfigList[drumConfigIndex].hpfq;
                chords[cc].lpf.para.cutoff_freq_nn.absolute = (uint16_t)drumConfigList[drumConfigIndex].lpffc_nn << 8;
                chords[cc].hpf.para.cutoff_freq_nn.absolute = (uint16_t)drumConfigList[drumConfigIndex].hpffc_nn << 8;

                // update
                if (drumConfigList[drumConfigIndex].lpffc_nn != STM32SYNTH_MIDINN_FILTER_DISABLE)
                {
                    stm32synth_component_updateLPF(&chords[cc].lpf, 0);
                }

                if (drumConfigList[drumConfigIndex].hpffc_nn != STM32SYNTH_MIDINN_FILTER_DISABLE)
                {
                    stm32synth_component_updateHPF(&chords[cc].hpf, 0);
                }
            }
#ifdef STM32SYNTH_FILTER
#ifdef STM32SYNTH_CHORDFILTER
            else
            {
                // update filter
                if (_config->filter[_inpurChord->channel].type == STM32SYNTH_FILTERTYPE_HPF)
                {
                    chords[cc].hpf.para.q_factor = _config->filter[_inpurChord->channel].q_factor;
                    // chords[cc].hpf.para.cutoff_freq_nn.absolute = _inpurChord->noteNum[0] + (_config->filter[_inpurChord->channel].cutoff_freq_nn.relative << 6);
                    chords[cc].hpf.para.cutoff_freq_nn.absolute = _config->filter[_inpurChord->channel].cutoff_freq_nn.absolute;
                    stm32synth_component_updateHPF(&chords[cc].hpf, 0);
                }
                else
                {
                    chords[cc].lpf.para.q_factor = _config->filter[_inpurChord->channel].q_factor;
                    // chords[cc].lpf.para.cutoff_freq_nn.absolute = _inpurChord->noteNum[0] + (_config->lpf[_inpurChord->channel].cutoff_freq_nn.relative << 6);
                    chords[cc].lpf.para.cutoff_freq_nn.absolute = _config->filter[_inpurChord->channel].cutoff_freq_nn.absolute;
                    stm32synth_component_updateLPF(&chords[cc].lpf, 0);
                }
            }
#endif /* STM32SYNTH_CHORDFILTER */
#endif /* STM32SYNTH_FILTER */

            res = STM32SYNTH_RES_OK;
            break;
        }
    }

    return res;
}

/**
 * @brief Handle a note-off event for a chord. This function searches for the chord matching the provided chord parameters and sets its ADSR state to release.
 *
 * @param _config Pointer to the synthesizer configuration.
 * @param _inpurChord Pointer to the chord structure containing the note-off information.
 * @return stm32synth_res_t STM32SYNTH_RES_OK if the note-off was successfully processed, STM32SYNTH_RES_NG otherwise.
 */
stm32synth_res_t stm32synth_component_noteoffChord(stm32synth_config_t *_config, stm32synth_chord_t *_inpurChord)
{
    stm32synth_res_t res = STM32SYNTH_RES_NG;

    for (uint8_t cc = 0; cc < STM32SYNTH_MAX_CHORD; cc++)
    {
        if (
            ((chords[cc].channel == _inpurChord->channel) && (chords[cc].noteNum[0] == _inpurChord->noteNum[0]) && (chords[cc].adsr.state < STM32SYNTH_ADSRSTATE_RELEASE)))
        {
            chords[cc].adsr.state = STM32SYNTH_ADSRSTATE_RELEASE;
            chords[cc].adsr.count = 0;

            res = STM32SYNTH_RES_OK;
            // break; //To delete with the next noteoff command if the noteoff command is not detected
        }
    }

    return res;
}

/**
 * @brief Handle a note-off event for all chords. This function sets the ADSR state of all chords to release.
 *
 * @return stm32synth_res_t STM32SYNTH_RES_OK if the note-off was successfully processed for all chords, STM32SYNTH_RES_NG otherwise.
 */
stm32synth_res_t stm32synth_component_noteoffAll()
{
    stm32synth_res_t res = STM32SYNTH_RES_OK;

    for (uint8_t cc = 0; cc < STM32SYNTH_MAX_CHORD; cc++)
    {
        chords[cc].adsr.state = STM32SYNTH_ADSRSTATE_RELEASE;
        chords[cc].adsr.count = 0;
    }

    return res;
}

/**
 * @brief Disable all chords. This function sets all chord structures to a disabled state.
 *
 * @return stm32synth_res_t STM32SYNTH_RES_OK if all chords were successfully disabled, STM32SYNTH_RES_NG otherwise.
 */
stm32synth_res_t stm32synth_component_disableChordAll()
{
    stm32synth_res_t res = STM32SYNTH_RES_OK;

    for (uint8_t cc = 0; cc < STM32SYNTH_MAX_CHORD; cc++)
    {
        chords[cc].noteNum[0] = STM32SYNTH_COMPONENT_CHORD_DISABLEDNN;
        chords[cc].channel = 0;
        chords[cc].velocity = 0;
        chords[cc].rad[STM32SYNTH_WAVEFORM_0] = 0;
        chords[cc].rad[STM32SYNTH_WAVEFORM_1] = 0;
        chords[cc].adsr.count = 0;
        chords[cc].adsr.state = STM32SYNTH_ADSRSTATE_WAIT;
        chords[cc].envelope.volume = 0;
        chords[cc].envelope.freq = 0;

#ifdef STM32SYNTH_FILTER
        chords[cc].envelope.cutoff = 0;
#endif
    }

    return res;
}

/**
 * @brief Disable a specific chord. This function sets the provided chord structure to a disabled state.
 *
 * @param _configChord Pointer to the chord structure to be disabled.
 * @return stm32synth_res_t STM32SYNTH_RES_OK if the chord was successfully disabled, STM32SYNTH_RES_NG otherwise.
 */
stm32synth_res_t stm32synth_component_disableChord(stm32synth_chord_t *_configChord)
{
    stm32synth_res_t res = STM32SYNTH_RES_OK;

    _configChord->noteNum[0] = STM32SYNTH_COMPONENT_CHORD_DISABLEDNN;
    _configChord->channel = 0;
    _configChord->velocity = 0;
    _configChord->rad[STM32SYNTH_WAVEFORM_0] = 0;
    _configChord->rad[STM32SYNTH_WAVEFORM_1] = 0;
    _configChord->adsr.count = 0;
    _configChord->adsr.state = STM32SYNTH_ADSRSTATE_WAIT;
    _configChord->envelope.volume = 0;
    _configChord->envelope.freq = 0;
#ifdef STM32SYNTH_FILTER
    _configChord->envelope.cutoff = 0;
#endif

    return res;
}

/**
 * @brief Update the chord buffer. This function processes all active chords and updates the audio buffer accordingly.
 *
 * @param _config Pointer to the synthesizer configuration.
 * @param _half Indicates which half of the buffer to update (former or latter).
 * @return stm32synth_res_t STM32SYNTH_RES_OK if the buffer was successfully updated, STM32SYNTH_RES_NG otherwise.
 */
stm32synth_res_t stm32synth_component_updateBuff(stm32synth_config_t *_config, stm32synth_update_half_t _half)
{
    stm32synth_res_t res = STM32SYNTH_RES_OK;
    uint16_t lfoUpdateStatus = 0;
    int8_t shift;
    q15_t scaleFract;

#ifdef STM32SYNTH_I2S
    static arm_biquad_casd_df1_inst_q15 filterInstanceL;
    static q15_t pStateL[4];
    static arm_biquad_casd_df1_inst_q15 filterInstanceR;
    static q15_t pStateR[4];

#ifdef STM32SYNTH_REVERB
    q15_t *chordsBuffTemp = tempScratch;
#endif /* STM32SYNTH_REVERB */
    q15_t *mbuff_pL = (_half == STM32SYNTH_UPDATE_LATTER) ? (&_config->buff.back[0][STM32SYNTH_HALF_NUM_SAMPLING]) : (&_config->buff.back[0][0]);
    q15_t *mbuff_pR = (_half == STM32SYNTH_UPDATE_LATTER) ? (&_config->buff.back[1][STM32SYNTH_HALF_NUM_SAMPLING]) : (&_config->buff.back[1][0]);
    arm_fill_q15(0, mbuff_pL, STM32SYNTH_HALF_NUM_SAMPLING);
    arm_fill_q15(0, mbuff_pR, STM32SYNTH_HALF_NUM_SAMPLING);

    filterInstanceL.pState = pStateL;
    filterInstanceL.pCoeffs = _config->filter_master.instance.pCoeffs;
    filterInstanceR.pState = pStateR;
    filterInstanceR.pCoeffs = _config->filter_master.instance.pCoeffs;
#else
    // DAC back buffer pointer
    q15_t *mbuff_p = (_half == STM32SYNTH_UPDATE_LATTER) ? (_config->buff.back + STM32SYNTH_HALF_NUM_SAMPLING) : (_config->buff.back);
#endif

    // tremolo
    stm32synth_component_lfo(&_config->tre_master);

