k-omura/STM32-synthesizer/Drivers/stm32_synth/components/stm32_synth_chord.c
    // vivlato
    stm32synth_component_lfo(&_config->vib_master);

#ifdef STM32SYNTH_FILTER
    // wow
    stm32synth_component_lfo(&_config->wow_master);
#endif /* STM32SYNTH_FILTER */

    // update Chord
    for (uint8_t cc = 0; cc < STM32SYNTH_MAX_CHORD; cc++)
    {
        if (((chords[cc].noteNum[0] >> 8) > 127) || (chords[cc].velocity == 0))
        {
            continue;
        }

        if ((lfoUpdateStatus & (0x0001 << chords[cc].channel)) == 0)
        {
            // tremolo
            stm32synth_component_lfo(&_config->tre[chords[cc].channel]);

            // vivlato
            stm32synth_component_lfo(&_config->vib[chords[cc].channel]);

#ifdef STM32SYNTH_FILTER
#ifdef STM32SYNTH_CHORDFILTER
            // wow
            stm32synth_component_lfo(&_config->wow[chords[cc].channel]);
#endif
#endif /* STM32SYNTH_FILTER */

            lfoUpdateStatus |= (0x0001 << chords[cc].channel);
        }

        stm32synth_chord_updateChord(_config, &chords[cc], mbuff_pL, mbuff_pR);
    }

#ifdef STM32SYNTH_FILTER
    if (_config->filter_master.para.cutoff_freq_nn.absolute < (127 << 8))
    {
        // Filter update
        if (_config->filter_master.para.type == STM32SYNTH_FILTERTYPE_LSF)
        {
            stm32synth_component_updateLSF(&_config->filter_master, (int32_t)_config->wow_master.val);
        }
        else
        {
            stm32synth_component_updateLPF(&_config->filter_master, (int32_t)_config->wow_master.val);
        }

        // input filter
#ifdef STM32SYNTH_FILT_CMSIS
#ifdef STM32SYNTH_I2S
        filterInstanceL.numStages = _config->filter_master.instance.numStages;
        filterInstanceL.postShift = _config->filter_master.instance.postShift;

        filterInstanceR.numStages = _config->filter_master.instance.numStages;
        filterInstanceR.postShift = _config->filter_master.instance.postShift;

        arm_biquad_cascade_df1_fast_q15(&filterInstanceL, mbuff_pL, mbuff_pL, STM32SYNTH_HALF_NUM_SAMPLING);
        arm_biquad_cascade_df1_fast_q15(&filterInstanceR, mbuff_pR, mbuff_pR, STM32SYNTH_HALF_NUM_SAMPLING);
#else
        arm_biquad_cascade_df1_fast_q15(&_config->filter_master.instance, mbuff_p, mbuff_p, STM32SYNTH_HALF_NUM_SAMPLING);
#endif /* #ifdef STM32SYNTH_I2S */
#endif /* STM32SYNTH_FILT_CMSIS */
    }
#endif /* STM32SYNTH_FILTER */

    // Master volume & Tremolo
    stm32synth_component_f32toq15fract((1 + _config->tre_master.val), &scaleFract, &shift);
#ifdef STM32SYNTH_I2S
    arm_scale_q15(mbuff_pL, scaleFract, shift, mbuff_pL, STM32SYNTH_HALF_NUM_SAMPLING);
    arm_scale_q15(mbuff_pR, scaleFract, shift, mbuff_pR, STM32SYNTH_HALF_NUM_SAMPLING);
#else
    arm_scale_q15(mbuff_p, scaleFract, shift, mbuff_p, STM32SYNTH_HALF_NUM_SAMPLING);
#endif

    // Reverb
#ifdef STM32SYNTH_REVERB
    q15_t *reverbBuff = _config->buff.reverb[reverbReadIndex];
    if (_config->reverb.level > 0)
    {
#ifdef STM32SYNTH_I2S
        // mean of left and right channel
        arm_add_q15(mbuff_pL, mbuff_pR, chordsBuffTemp, STM32SYNTH_HALF_NUM_SAMPLING);
        arm_shift_q15(chordsBuffTemp, -1, chordsBuffTemp, STM32SYNTH_HALF_NUM_SAMPLING);

        // add reverb to left and right channel
        arm_add_q15(mbuff_pL, reverbBuff, mbuff_pL, STM32SYNTH_HALF_NUM_SAMPLING);
        arm_add_q15(mbuff_pR, reverbBuff, mbuff_pR, STM32SYNTH_HALF_NUM_SAMPLING);

        // update reverb buffer
        arm_add_q15(chordsBuffTemp, reverbBuff, chordsBuffTemp, STM32SYNTH_HALF_NUM_SAMPLING);
        arm_scale_q15(chordsBuffTemp, _config->reverb.scaleFract, _config->reverb.shift, reverbBuff, STM32SYNTH_HALF_NUM_SAMPLING);
#else
        // add reverb to buffer
        arm_add_q15(mbuff_p, reverbBuff, mbuff_p, STM32SYNTH_HALF_NUM_SAMPLING);
        // update reverb buffer
        arm_scale_q15(mbuff_p, _config->reverb.scaleFract, _config->reverb.shift, reverbBuff, STM32SYNTH_HALF_NUM_SAMPLING);
#endif /* STM32SYNTH_I2S */
        // update reverb read index
        reverbReadIndex = (reverbReadIndex < (STM32SYNTH_REVERB_NUM - 1)) ? (reverbReadIndex + 1) : 0;
    }
#endif /* STM32SYNTH_REVERB */

#ifndef STM32SYNTH_I2S
    // offset audio
    arm_offset_f32(mbuff_p, STM32SYNTH_GND_LEVEL, mbuff_p, STM32SYNTH_HALF_NUM_SAMPLING);
#endif /* STM32SYNTH_I2S */

    return res;
}

#ifdef STM32SYNTH_SIN_CORDIC
/**
 * @brief Initialize the CORDIC hardware for sine calculations.
 *
 * @param _cordicHW Pointer to the CORDIC hardware handle.
 * @return stm32synth_res_t STM32SYNTH_RES_OK if the CORDIC was successfully initialized, STM32SYNTH_RES_NG otherwise.
 */
stm32synth_res_t stm32synth_component_initCORDIC(CORDIC_HandleTypeDef *_cordicHW)
{
    stm32synth_res_t res = STM32SYNTH_RES_OK;
    cordicHW = _cordicHW;

    CORDIC_ConfigTypeDef cordicConfig;

    cordicConfig.Function = CORDIC_FUNCTION_SINE;
    cordicConfig.Precision = CORDIC_PRECISION_2CYCLES;
    cordicConfig.Scale = CORDIC_SCALE_0;
    cordicConfig.NbWrite = CORDIC_NBWRITE_1;
    cordicConfig.NbRead = CORDIC_NBREAD_1;
    cordicConfig.InSize = CORDIC_OUTSIZE_16BITS;
    cordicConfig.OutSize = CORDIC_OUTSIZE_16BITS;

    HAL_CORDIC_Configure(cordicHW, &cordicConfig);

    return res;
}
#endif /* STM32SYNTH_SIN_CORDIC */

//--------------------------------------------------------------------------------------------------------
#ifdef STM32SYNTH_I2S
/**
 * @brief Update the chord. This function processes the specified chord and updates the audio buffer accordingly.
 *
 * @param _config Pointer to the synthesizer configuration.
 * @param _configChord Pointer to the chord structure to be updated.
 * @param _pbuffL Pointer to the left audio buffer (only used if STM32SYNTH_I2S is defined).
 * @param _pbuffR Pointer to the right audio buffer (only used if STM32SYNTH_I2S is defined).
 * @param _pbuff Pointer to the audio buffer (only used if STM32SYNTH_I2S is not defined).
 * @return stm32synth_res_t STM32SYNTH_RES_OK if the chord was successfully updated, STM32SYNTH_RES_NG otherwise.
 */
stm32synth_res_t stm32synth_chord_updateChord(stm32synth_config_t *_config, stm32synth_chord_t *_configChord, q15_t *_pbuffL, q15_t *_pbuffR)
#else
stm32synth_res_t stm32synth_chord_updateChord(stm32synth_config_t *_config, stm32synth_chord_t *_configChord, q15_t *_pbuff)
#endif
{
    stm32synth_res_t res = STM32SYNTH_RES_OK;

