k-omura/STM32-synthesizer/Drivers/stm32_synth/components/stm32_synth_chord.c
    if (_configChord->noteNum[0] > (127 << 8))
    {
        res = STM32SYNTH_RES_NG;
        return res;
    }

    q15_t *chordBuff = chordScratch;
    q15_t *radBuff = phaseScratch;
    arm_fill_q15(0, chordBuff, STM32SYNTH_HALF_NUM_SAMPLING);
    float32_t amp = _config->volume[_configChord->channel] * _configChord->velocity;
    int8_t shift;
    q15_t scaleFract;
    int16_t distortion16;

    // adsr
    float32_t adsr_amp = 0;
    stm32synth_chord_adsrCurve(_config, _configChord, &adsr_amp);
    amp *= adsr_amp;
    amp *= 1.0f + _config->tre[_configChord->channel].val;

    // envelope
    int16_t envelope_volume, envelope_freq_nn;
    stm32synth_chord_envelope(&(_config->envelope[_configChord->channel].volume), &(_configChord->envelope.volume), &envelope_volume);
    if (_configChord->channel == STM32SYNTH_MIDINN_DRUMCH)
    {
        stm32synth_config_envelopec_t freqenv;

        freqenv.time_ms = _config->envelope[_configChord->channel].freq.time_ms;

#ifdef STM32SYNTH_DRUM_TESTMODE
        if ((_configChord->noteNum[0] >> 8) == STM32SYNTH_MIDINN_LOWESTDRUM)
        {
            freqenv.finish_value = _config->envelope[_configChord->channel].freq.finish_value;
        }
        else
        {
#endif /* STM32SYNTH_DRUM_TESTMODE */
            freqenv.finish_value = drumConfigList[_configChord->noteNum[1]].freqenv_diff;
#ifdef STM32SYNTH_DRUM_TESTMODE
        }
#endif /* STM32SYNTH_DRUM_TESTMODE */

        stm32synth_chord_envelope(&freqenv, &(_configChord->envelope.freq), &envelope_freq_nn);
    }
    else
    {
        stm32synth_chord_envelope(&(_config->envelope[_configChord->channel].freq), &(_configChord->envelope.freq), &envelope_freq_nn);
    }
    amp *= 1.0f + envelope_volume / 64.0f;

#ifdef STM32SYNTH_FILTER
#ifdef STM32SYNTH_CHORDFILTER
    int16_t envelope_cutoff;
    stm32synth_chord_envelope(&(_config->envelope[_configChord->channel].cutoff), &(_configChord->envelope.cutoff), &envelope_cutoff);
#endif /* STM32SYNTH_CHORDFILTER */
#endif /* STM32SYNTH_FILTER */

    // Convert frequency to phase
    if (_configChord->channel == STM32SYNTH_MIDINN_DRUMCH)
    {
        uint8_t drumConfigIndex = _configChord->noteNum[1];
        uint16_t drum_nn = drumConfigList[drumConfigIndex].nn;

        if (drum_nn && (drumConfigList[drumConfigIndex].waveformType & 0b00000111))
        {
            for (uint8_t ww = 0; ww < STM32SYNTH_WAVEFORM_NUM_PERCHORD; ww++)
            {
                if ((ww == 1) && ((drumConfigList[drumConfigIndex].waveformType & STM32SYNTH_CHORD_DRUM_TYPE_SQU) == 0))
                {
                    continue;
                }

                uint16_t nn = (drum_nn << 8);
                if (ww == 1)
                {
#ifdef STM32SYNTH_DRUM_TESTMODE
                    if ((_configChord->noteNum[0] >> 8) == STM32SYNTH_MIDINN_LOWESTDRUM)
                    {
                        nn += _config->waveform[_configChord->channel][ww].pitch;
                    }
                    else
                    {
#endif /* STM32SYNTH_DRUM_TESTMODE */
                        nn += drumConfigList[drumConfigIndex].pitch2;
#ifdef STM32SYNTH_DRUM_TESTMODE
                    }
#endif /* STM32SYNTH_DRUM_TESTMODE */
                }

                if (envelope_freq_nn < 0)
                {
                    int16_t inv_envelope_freq_nn = -envelope_freq_nn;
                    nn = (nn > inv_envelope_freq_nn) ? (nn - inv_envelope_freq_nn) : (0);
                }
                else
                {
                    nn = nn + envelope_freq_nn;
                    nn = (nn > STM32SYNTH_MAX_FREQ_NOTE) ? STM32SYNTH_MAX_FREQ_NOTE : nn;
                }

                stm32synth_chord_makerad(_configChord, nn, radBuff, ww);

                if (drumConfigList[drumConfigIndex].waveformType & STM32SYNTH_CHORD_DRUM_TYPE_SIN)
                {
                    stm32synth_chord_addsine(_config, _configChord, chordBuff, radBuff, ww);
                }
                if (drumConfigList[drumConfigIndex].waveformType & STM32SYNTH_CHORD_DRUM_TYPE_TRI)
                {
                    stm32synth_chord_addtrgl(_config, _configChord, chordBuff, radBuff, ww);
                }
                if (drumConfigList[drumConfigIndex].waveformType & STM32SYNTH_CHORD_DRUM_TYPE_SQU)
                {
                    stm32synth_chord_addsque(_config, _configChord, chordBuff, radBuff, ww);
                }
            }
        }

        if (drumConfigList[drumConfigIndex].waveformType & STM32SYNTH_CHORD_DRUM_TYPE_NOISE)
        {
            stm32synth_chord_addnoise(_config, drumConfigList[drumConfigIndex].wn_amp, chordBuff);
        }

        // input filter
        if (drumConfigList[drumConfigIndex].lpffc_nn != STM32SYNTH_MIDINN_FILTER_DISABLE)
        {
#ifdef STM32SYNTH_FILT_CMSIS
            arm_biquad_cascade_df1_fast_q15(&_configChord->lpf.instance, chordBuff, chordBuff, STM32SYNTH_HALF_NUM_SAMPLING); // LPF
#endif                                                                                                                        /* STM32SYNTH_FILT_CMSIS */
        }

        if (drumConfigList[drumConfigIndex].hpffc_nn != STM32SYNTH_MIDINN_FILTER_DISABLE)
        {
#ifdef STM32SYNTH_FILT_CMSIS
            arm_biquad_cascade_df1_fast_q15(&_configChord->hpf.instance, chordBuff, chordBuff, STM32SYNTH_HALF_NUM_SAMPLING); // HPF
#endif                                                                                                                        /* STM32SYNTH_FILT_CMSIS */
        }

#ifdef STM32SYNTH_DRUM_TESTMODE
        if ((_configChord->noteNum[0] >> 8) == STM32SYNTH_MIDINN_LOWESTDRUM)
        {
            distortion16 = _config->distortion[_configChord->channel];
        }
        else
        {
#endif /* STM32SYNTH_DRUM_TESTMODE */
            distortion16 = drumConfigList[drumConfigIndex].distortion;
#ifdef STM32SYNTH_DRUM_TESTMODE
        }
#endif /* STM32SYNTH_DRUM_TESTMODE */
    }
    else
    {
        uint16_t nn[2];
        nn[1] = _configChord->noteNum[0] + _config->pitch[_configChord->channel] + _config->vib_master.val + _config->vib[_configChord->channel].val + envelope_freq_nn;
        nn[0] = nn[1] + _config->waveform[_configChord->channel][0].pitch;
        nn[1] = nn[1] + _config->waveform[_configChord->channel][1].pitch;

        for (uint8_t ww = 0; ww < STM32SYNTH_WAVEFORM_NUM_PERCHORD; ww++)
        {
            if ((_config->waveform[_configChord->channel][ww].sin_level == 0) && (_config->waveform[_configChord->channel][ww].squ_level == 0) && (_config->waveform[_configChord->channel][ww].tri_level == 0))
            {
                continue;
            }

            stm32synth_chord_makerad(_configChord, nn[ww], radBuff, ww);

            stm32synth_chord_addsine(_config, _configChord, chordBuff, radBuff, ww);
            stm32synth_chord_addsque(_config, _configChord, chordBuff, radBuff, ww);
            stm32synth_chord_addtrgl(_config, _configChord, chordBuff, radBuff, ww);
        }

#ifdef STM32SYNTH_FILTER
#ifdef STM32SYNTH_CHORDFILTER
        // if (_config->filter[_configChord->channel].cutoff_freq_nn.relative < (127 - 0x40))
        if (_config->filter[_configChord->channel].cutoff_freq_nn.absolute < (127 << 8))
        {
            // update relative
            /*
            _configChord->lpf.para.q_factor = _config->filter[_configChord->channel].q_factor;
            _configChord->lpf.para.cutoff_freq_nn.absolute = nn[0] + _config->filter[_configChord->channel].cutoff_freq_nn.relative;
            stm32synth_component_updateLPF(&_configChord->lpf, (int32_t)_config->wow[_configChord->channel].val);
            // */

            // update absolute
            //*
            if (((_config->wow[_configChord->channel].amp != 0) && (_config->wow[_configChord->channel].freq != 0)) || ((_config->envelope[_configChord->channel].cutoff.finish_value != 0) && (_config->envelope[_configChord->channel].cutoff.time_ms != 0)))
            {
                if (_config->filter[_configChord->channel].type == STM32SYNTH_FILTERTYPE_HPF)
                {
                    stm32synth_component_updateHPF(&_configChord->hpf, (int32_t)_config->wow[_configChord->channel].val + envelope_cutoff);
                }
                else
                {
                    stm32synth_component_updateLPF(&_configChord->lpf, (int32_t)_config->wow[_configChord->channel].val + envelope_cutoff);
                }
            }
            // */

