k-omura/STM32-synthesizer/Drivers/stm32_synth/components/stm32_synth_chord.c
#ifdef STM32SYNTH_FILT_CMSIS
            if (_config->filter[_configChord->channel].type == STM32SYNTH_FILTERTYPE_HPF)
            {
                arm_biquad_cascade_df1_fast_q15(&_configChord->hpf.instance, chordBuff, chordBuff, STM32SYNTH_HALF_NUM_SAMPLING); // Filter
            }
            else
            {
                arm_biquad_cascade_df1_fast_q15(&_configChord->lpf.instance, chordBuff, chordBuff, STM32SYNTH_HALF_NUM_SAMPLING); // Filter
            }
#endif /* STM32SYNTH_FILT_CMSIS */

#endif /* STM32SYNTH_CHORDFILTER */
#endif /* STM32SYNTH_FILTER */
        }

        distortion16 = _config->distortion[_configChord->channel];
    }

    // Distortion (Clipping)
    if (distortion16 < 128)
    {
        q15_t chordMax;
        uint32_t chordMaxIndex;
        q15_t distortion = distortion16 << STM32SYNTH_CHORD_DISTORTION_SHIFT;
        arm_absmax_q15(chordBuff, STM32SYNTH_HALF_NUM_SAMPLING, &chordMax, &chordMaxIndex);
        arm_clip_q15(chordBuff, chordBuff, -distortion, distortion, STM32SYNTH_HALF_NUM_SAMPLING);
        if (chordMax > distortion)
        {
            amp = amp * (float32_t)chordMax / (float32_t)distortion;
        }
    }

    // Add to master array
#ifdef STM32SYNTH_I2S
    q15_t *chordBuffTemp = tempScratch;

    // Amp and Pan
    stm32synth_component_f32toq15fract(amp * _config->pan[_configChord->channel].l_level, &scaleFract, &shift);
    arm_scale_q15(chordBuff, scaleFract, shift, chordBuffTemp, STM32SYNTH_HALF_NUM_SAMPLING);
    arm_add_q15(_pbuffL, chordBuffTemp, _pbuffL, STM32SYNTH_HALF_NUM_SAMPLING);

    stm32synth_component_f32toq15fract(amp * _config->pan[_configChord->channel].r_level, &scaleFract, &shift);
    arm_scale_q15(chordBuff, scaleFract, shift, chordBuffTemp, STM32SYNTH_HALF_NUM_SAMPLING);
    arm_add_q15(_pbuffR, chordBuffTemp, _pbuffR, STM32SYNTH_HALF_NUM_SAMPLING);
#else
// Amp
stm32synth_component_f32toq15fract(amp, &scaleFract, &shift);
arm_scale_q15(chordBuff, scaleFract, shift, chordBuff, STM32SYNTH_HALF_NUM_SAMPLING);
arm_add_q15(chordBuff, _pbuff, _pbuff, STM32SYNTH_HALF_NUM_SAMPLING);
#endif /* STM32SYNTH_I2S */

    return res;
}

/**
 * @brief Calculate the ADSR curve for a specific chord.
 *
 * @param _config Pointer to the synthesizer configuration.
 * @param _configChord Pointer to the chord structure.
 * @param _amp Pointer to the amplitude value to be updated.
 * @return stm32synth_res_t STM32SYNTH_RES_OK if the ADSR curve was successfully calculated, STM32SYNTH_RES_NG otherwise.
 */
stm32synth_res_t stm32synth_chord_adsrCurve(stm32synth_config_t *_config, stm32synth_chord_t *_configChord, float32_t *_amp)
{
    stm32synth_res_t res = STM32SYNTH_RES_OK;
    float32_t adsr_time = 0;
    int32_t adsr_time_count = 0;

    switch (_configChord->adsr.state)
    {
    case STM32SYNTH_ADSRSTATE_ATTACK:
        adsr_time_count = _config->adsr[_configChord->channel].attack_ms + 1;
        adsr_time = adsr_time_count;
        break;
    case STM32SYNTH_ADSRSTATE_DECAY:
        adsr_time_count = _config->adsr[_configChord->channel].decay_ms;
        adsr_time = adsr_time_count;
        break;
    case STM32SYNTH_ADSRSTATE_SUSTAIN:
    {
        *_amp = 1.0f;
        if ((_config->phonic[_configChord->channel] == STM32SYNTH_PHONIC_POLY_SUSTON) || (_config->phonic[_configChord->channel] == STM32SYNTH_PHONIC_MONO_SUSTON))
        {
            return res;
        }
        adsr_time_count = -100;
        adsr_time = adsr_time_count;
        break;
    }
    case STM32SYNTH_ADSRSTATE_RELEASE:
        adsr_time_count = _config->adsr[_configChord->channel].release_ms;
        adsr_time = adsr_time_count;
        break;
    default:
        *_amp = 0;
        res = STM32SYNTH_RES_NG;
        break;
    }

    _configChord->adsr.count += (1000 * STM32SYNTH_HALF_NUM_SAMPLING) / STM32SYNTH_SAMPLE_FREQ;
    if (_configChord->adsr.count >= adsr_time_count)
    {
        if (_configChord->adsr.state == STM32SYNTH_ADSRSTATE_RELEASE)
        {
            _configChord->adsr.state = STM32SYNTH_ADSRSTATE_DONE;
            *_amp = 0.0f;
            stm32synth_component_disableChord(_configChord);
            res = STM32SYNTH_RES_NG;
            return res;
        }

        _configChord->adsr.count = 0;
        _configChord->adsr.state++;
    }

    if (adsr_time <= 0.0f)
    {
        *_amp = 0.0f;
    }
    else
    {
        //*_amp = stm32synth_fast_exp10f(-2.0f * (float32_t)_configChord->adsr.count / adsr_time);
        *_amp = stm32synth_chord_exp_neg2_ratio((uint32_t)_configChord->adsr.count, (uint32_t)adsr_time_count);
    }

    switch (_configChord->adsr.state)
    {
    case STM32SYNTH_ADSRSTATE_ATTACK:
        *_amp = _config->adsr[_configChord->channel].attack_level * (1.0f - (*_amp));
        break;
    case STM32SYNTH_ADSRSTATE_DECAY:
        *_amp = 1.0f + ((_config->adsr[_configChord->channel].attack_level - 1.0f) * (*_amp));
        break;
    case STM32SYNTH_ADSRSTATE_SUSTAIN:
        *_amp = 1.0f;
        break;
    case STM32SYNTH_ADSRSTATE_RELEASE:
        //*_amp = *_amp;
        break;
    case STM32SYNTH_ADSRSTATE_DONE:
    default:
        *_amp = 0.0f;
        stm32synth_component_disableChord(_configChord);
        res = STM32SYNTH_RES_NG;
        break;
    }

    return res;
}

/**
 * @brief Calculate the envelope for a specific chord.
 *
 * @param _envelopec Pointer to the envelope configuration.
 * @param _envelopeCount Pointer to the current envelope count.
 * @param _outval Pointer to the output value to be updated.
 * @return stm32synth_res_t STM32SYNTH_RES_OK if the envelope was successfully calculated, STM32SYNTH_RES_NG otherwise.
 */
stm32synth_res_t stm32synth_chord_envelope(stm32synth_config_envelopec_t *_envelopec, uint32_t *_envelopeCount, int16_t *_outval)
{
    stm32synth_res_t res = STM32SYNTH_RES_OK;

    if (_envelopec->finish_value == 0)
    {
        (*_outval) = 0;
        return STM32SYNTH_RES_NG;
    }

    if ((*_envelopeCount) > _envelopec->time_ms)
    {
        (*_outval) = _envelopec->finish_value;
        return STM32SYNTH_RES_OK;
    }

    (*_envelopeCount) += (1000 * STM32SYNTH_HALF_NUM_SAMPLING) / STM32SYNTH_SAMPLE_FREQ;
    //(*_outval) = _envelopec->finish_value + (int16_t)((float32_t)(-_envelopec->finish_value) * stm32synth_fast_exp10f(-2.0f * (float32_t)(*_envelopeCount) / (float32_t)_envelopec->time_ms));
    (*_outval) = _envelopec->finish_value + (int16_t)((float32_t)(-_envelopec->finish_value) * stm32synth_chord_exp_neg2_ratio(*_envelopeCount, (uint32_t)_envelopec->time_ms));

    return res;
}

/**
 * @brief Calculate the radian values for a specific chord.
 *
 * @param _configChord Pointer to the chord structure.
 * @param _nn Note number.
 * @param _radBuff Pointer to the radian buffer to be updated.
 * @param _wnum Waveform number.
 * @return stm32synth_res_t STM32SYNTH_RES_OK if the radian values were successfully calculated, STM32SYNTH_RES_NG otherwise.
 */
stm32synth_res_t stm32synth_chord_makerad(stm32synth_chord_t *_configChord, uint16_t _nn, q15_t *_radBuff, stm32synth_waveformnum_t _wnum)
{
    stm32synth_res_t res = STM32SYNTH_RES_OK;
    float32_t freq = STM32SYNTH_TUNING * stm32synth_fast_exp2f(((float32_t)_nn / 3072.0f) - 5.75f);

    // float32_t delta_omega = freq * STM32SYNTH_DOUBLE_PI / (float32_t)STM32SYNTH_SAMPLE_FREQ;
    q15_t delta_omega_q15 = (q15_t)(freq * (STM32SYNTH_Q15_MAX << 1) / STM32SYNTH_SAMPLE_FREQ);
    q15_t temp = _configChord->rad[_wnum]; // init;

