k-omura/STM32-synthesizer/Drivers/stm32_synth/components/stm32_synth_chord.c
    q15_t *radBuff_p = _radBuff;
    for (uint32_t t = 0; t < STM32SYNTH_HALF_NUM_SAMPLING_BY_4; t++)
    {
        *radBuff_p = temp;
        *(radBuff_p + 1) = *(radBuff_p) + delta_omega_q15;
        *(radBuff_p + 2) = *(radBuff_p + 1) + delta_omega_q15;
        *(radBuff_p + 3) = *(radBuff_p + 2) + delta_omega_q15;
        temp = *(radBuff_p + 3) + delta_omega_q15;
        radBuff_p += 4;
    }
    _configChord->rad[_wnum] = temp;

    return res;
}

/**
 * @brief Add a sine waveform to the chord buffer.
 *
 * @param _config Pointer to the synthesizer configuration.
 * @param _configChord Pointer to the chord structure.
 * @param _chordBuff Pointer to the chord buffer to be updated.
 * @param _radBuff Pointer to the radian buffer.
 * @param _wnum Waveform number.
 * @return stm32synth_res_t STM32SYNTH_RES_OK if the sine waveform was successfully added, STM32SYNTH_RES_NG otherwise.
 */
stm32synth_res_t stm32synth_chord_addsine(stm32synth_config_t *_config, stm32synth_chord_t *_configChord, q15_t *_chordBuff, q15_t *_radBuff, stm32synth_waveformnum_t _wnum)
{
    stm32synth_res_t res = STM32SYNTH_RES_OK;

    if (_config->waveform[_configChord->channel][_wnum].sin_level < 0.05f)
    {
        res = STM32SYNTH_RES_NG;
        return res;
    }

    q15_t *buff = tempScratch;
    int8_t shift;
    q15_t scaleFract;
    stm32synth_component_f32toq15fract(_config->waveform[_configChord->channel][_wnum].sin_level / (float32_t)(1 << (STM32SYNTH_CHORD_BASE_AMP_SHIFT - 1)), &scaleFract, &shift);

#ifdef STM32SYNTH_SIN_CORDIC
    // CORDIC Baremetal Zero-Overhead mode
    q15_t *p_tmp_in_buff = (q15_t *)_radBuff;
    q15_t *p_tmp_out_buff = (q15_t *)buff;

    // Write of input data in Write Data register, and increment input buffer pointer
    cordicHW->Instance->WDATA = (int32_t)((*p_tmp_in_buff++) << 16);
    for (uint16_t index = (STM32SYNTH_HALF_NUM_SAMPLING - 1); index > 0; index--)
    {
        cordicHW->Instance->WDATA = (int32_t)((*p_tmp_in_buff++) << 16);
        (*p_tmp_out_buff++) = (q15_t)(cordicHW->Instance->RDATA & 0x0000FFFF);
    }
    (*p_tmp_out_buff) = (q15_t)(cordicHW->Instance->RDATA & 0x0000FFFF);
#else
    q15_t *buff_p = buff;
    q15_t *radBuff_p = _radBuff;

    for (uint16_t t = 0; t < STM32SYNTH_HALF_NUM_SAMPLING; t++)
    {
        uint16_t phase = (uint16_t)(*radBuff_p++);
        uint16_t idx = (uint16_t)(phase >> 6);     // 10-bit index into 1024-entry table
        uint16_t frac = (uint16_t)(phase & 0x3Fu); // 6-bit fractional position

        int32_t v0 = (int32_t)sine_lut[idx];
        int32_t v1 = (int32_t)sine_lut[(idx + 1u) & 0x03FFu];
        int32_t diff = v1 - v0;

        // linear interpolation: v = v0 + diff * frac / 64
        int32_t interp = v0 + ((diff * (int32_t)frac) >> 6);

        *buff_p++ = (q15_t)interp;
    }
#endif /* STM32SYNTH_SIN_CORDIC */

    arm_scale_q15(buff, scaleFract, shift, buff, STM32SYNTH_HALF_NUM_SAMPLING);
    arm_add_q15(_chordBuff, buff, _chordBuff, STM32SYNTH_HALF_NUM_SAMPLING);

    return res;
}

/**
 * @brief Add a square waveform to the chord buffer.
 *
 * @param _config Pointer to the synthesizer configuration.
 * @param _configChord Pointer to the chord structure.
 * @param _chordBuff Pointer to the chord buffer to be updated.
 * @param _radBuff Pointer to the radian buffer.
 * @param _wnum Waveform number.
 * @return stm32synth_res_t STM32SYNTH_RES_OK if the square waveform was successfully added, STM32SYNTH_RES_NG otherwise.
 */
stm32synth_res_t stm32synth_chord_addsque(stm32synth_config_t *_config, stm32synth_chord_t *_configChord, q15_t *_chordBuff, q15_t *_radBuff, stm32synth_waveformnum_t _wnum)
{
    stm32synth_res_t res = STM32SYNTH_RES_OK;

    if (_config->waveform[_configChord->channel][_wnum].squ_level < 0.05f)
    {
        res = STM32SYNTH_RES_NG;
        return res;
    }

    if ((_config->waveform[_configChord->channel][_wnum].squ_duty <= 0.0f) || (_config->waveform[_configChord->channel][_wnum].squ_duty >= 1.0f))
    {
        res = STM32SYNTH_RES_NG;
        return res;
    }

    float32_t squ_duty, squ_level;
    squ_duty = _config->waveform[_configChord->channel][_wnum].squ_duty;
    squ_level = _config->waveform[_configChord->channel][_wnum].squ_level;

    // q15_t buff[STM32SYNTH_HALF_NUM_SAMPLING] = {0};

    /*
    int8_t shift;
    q15_t scaleFract;
    stm32synth_component_f32toq15fract(squ_level, &scaleFract, &shift);
    //*/
    // q15_t level = (int16_t)stm32synth_fast_roundf((float32_t)STM32SYNTH_CHORD_BASE_AMP * squ_level);
    q15_t level = (int16_t)((float32_t)STM32SYNTH_CHORD_BASE_AMP * squ_level);

    int32_t dutyHighRad_32 = (int32_t)(squ_duty * STM32SYNTH_Q15_MAX);
    q15_t dutyHighRad = (int16_t)(2 * dutyHighRad_32 - STM32SYNTH_Q15_MAX);

    for (uint16_t t = 0; t < STM32SYNTH_HALF_NUM_SAMPLING; t++)
    {
        // buff[t] = (_radBuff[t] < dutyHighRad) ? level : -level;
        _chordBuff[t] += (_radBuff[t] < dutyHighRad) ? level : -level;
    }

    // arm_scale_q15(buff, scaleFract, shift, buff, STM32SYNTH_HALF_NUM_SAMPLING);
    // arm_add_q15(_chordBuff, buff, _chordBuff, STM32SYNTH_HALF_NUM_SAMPLING);

    return res;
}

/**
 * @brief Add a triangle waveform to the chord buffer.
 *
 * @param _config Pointer to the synthesizer configuration.
 * @param _configChord Pointer to the chord structure.
 * @param _chordBuff Pointer to the chord buffer to be updated.
 * @param _radBuff Pointer to the radian buffer.
 * @param _wnum Waveform number.
 * @return stm32synth_res_t STM32SYNTH_RES_OK if the triangle waveform was successfully added, STM32SYNTH_RES_NG otherwise.
 */
stm32synth_res_t stm32synth_chord_addtrgl(stm32synth_config_t *_config, stm32synth_chord_t *_configChord, q15_t *_chordBuff, q15_t *_radBuff, stm32synth_waveformnum_t _wnum)
{
    stm32synth_res_t res = STM32SYNTH_RES_OK;

    if ((_config->waveform[_configChord->channel][_wnum].tri_level < 0.05f) || (_config->waveform[_configChord->channel][_wnum].tri_peak < 0.0f) || (_config->waveform[_configChord->channel][_wnum].tri_peak > 1.0f))
    {
        res = STM32SYNTH_RES_NG;
        return res;
    }

    // q15_t buff[STM32SYNTH_HALF_NUM_SAMPLING] = {0};

