k-omura/STM32-synthesizer/Drivers/stm32_synth/components/stm32_synth_chord.c
    /*
    int8_t shift;
    q15_t scaleFract;
    stm32synth_component_f32toq15fract(_config->waveform[_configChord->channel][_wnum].tri_level, &scaleFract, &shift);
    //*/
    float32_t tri_level = _config->waveform[_configChord->channel][_wnum].tri_level;

    float32_t peakPoint_f32 = _config->waveform[_configChord->channel][_wnum].tri_peak * (float32_t)STM32SYNTH_Q15_MAX;
    q15_t peakPoint_q15 = (int16_t)(2.0f * peakPoint_f32 - (float32_t)STM32SYNTH_Q15_MAX);

    float32_t temp_denominator = (float32_t)STM32SYNTH_Q15_MAX - peakPoint_f32;

    float32_t doubel_amp_up = tri_level * (float32_t)(STM32SYNTH_CHORD_BASE_AMP) / peakPoint_f32;
    float32_t doubel_intercept_up = doubel_amp_up * temp_denominator;
    float32_t doubel_amp_down = -tri_level * (float32_t)(STM32SYNTH_CHORD_BASE_AMP) / temp_denominator;
    float32_t doubel_intercept_down = doubel_amp_down * peakPoint_f32;

    for (uint16_t t = 0; t < STM32SYNTH_HALF_NUM_SAMPLING; t++)
    {
        if (_radBuff[t] < peakPoint_q15)
        {
            // buff[t] = (int16_t)stm32synth_fast_roundf(doubel_amp_up * (float32_t)_radBuff[t] + doubel_intercept_up);
            // buff[t] = (int16_t)(doubel_amp_up * (float32_t)_radBuff[t] + doubel_intercept_up);
            _chordBuff[t] += (int16_t)(doubel_amp_up * (float32_t)_radBuff[t] + doubel_intercept_up);
        }
        else
        {
            // buff[t] = (int16_t)stm32synth_fast_roundf(doubel_amp_down * (float32_t)_radBuff[t] - doubel_intercept_down);
            // buff[t] = (int16_t)(doubel_amp_down * (float32_t)_radBuff[t] - doubel_intercept_down);
            _chordBuff[t] += (int16_t)(doubel_amp_down * (float32_t)_radBuff[t] - doubel_intercept_down);
        }
    }

    // arm_scale_q15(buff, scaleFract, shift, buff, STM32SYNTH_HALF_NUM_SAMPLING);
    // arm_add_q15(_chordBuff, buff, _chordBuff, STM32SYNTH_HALF_NUM_SAMPLING);

    return res;
}

/**
 * @brief Add noise to the chord buffer.
 *
 * @param _config Pointer to the synthesizer configuration.
 * @param _amp Amplitude of the noise.
 * @param _chordBuff Pointer to the chord buffer to be updated.
 * @return stm32synth_res_t STM32SYNTH_RES_OK if the noise was successfully added, STM32SYNTH_RES_NG otherwise.
 */
stm32synth_res_t stm32synth_chord_addnoise(stm32synth_config_t *_config, float32_t _amp, q15_t *_chordBuff)
{
    stm32synth_res_t res = STM32SYNTH_RES_OK;

    q15_t *buff = tempScratch;

    // scale
    float32_t scale = _amp * 0.007f;
    int8_t shift;
    q15_t scaleFract;
    stm32synth_component_f32toq15fract(scale, &scaleFract, &shift);

    // lightweight rand: xorshift32
    static uint32_t xs_state = 0;
    if (xs_state == 0)
    {
        xs_state = 0xA5A5A5A5u; // seed
    }

    for (uint16_t t = 0; t < STM32SYNTH_HALF_NUM_SAMPLING; t += 2)
    {
        // xorshift32 -- 3 xor/shift ops
        xs_state ^= xs_state << 13;
        xs_state ^= xs_state >> 17;
        xs_state ^= xs_state << 5;

        uint16_t lo = (uint16_t)(xs_state & 0xFFFFu);
        uint16_t hi = (uint16_t)(xs_state >> 16);

        buff[t] = (q15_t)(*(int16_t *)&lo);
        buff[t + 1] = (q15_t)(*(int16_t *)&hi);
    }

    arm_scale_q15(buff, scaleFract, shift, buff, STM32SYNTH_HALF_NUM_SAMPLING);
    arm_add_q15(_chordBuff, buff, _chordBuff, STM32SYNTH_HALF_NUM_SAMPLING);

    return res;
}

/**
 * @brief Calculate the exponential decay ratio for ADSR envelope using a precomputed table and linear interpolation.
 *
 * @param _count
 * @param _time_ms
 * @return float32_t
 */
float32_t stm32synth_chord_exp_neg2_ratio(uint32_t _count, uint32_t _time_ms)
{
    if ((_time_ms == 0u) || (_count == 0u))
    {
        return 1.0f;
    }

    if (_count >= _time_ms)
    {
        return exp_neg2_table[256];
    }

    uint32_t position_q8 = (_count << 16) / _time_ms;
    uint32_t idx = position_q8 >> 8;
    if (idx >= 256u)
    {
        return exp_neg2_table[256];
    }

    uint32_t next = idx + 1u;
    float32_t ratio = (float32_t)(position_q8 & 0xFFu) * 0.00390625f; // 0.00390625f = 1.0f / 256.0f
    return exp_neg2_table[idx] + (exp_neg2_table[next] - exp_neg2_table[idx]) * ratio;
}

#ifdef STM32SYNTH_DRUM_TESTMODE
/**
 * @brief Change the drum configuration to test mode.
 *
 * @param _midiCC MIDI control change number.
 * @param _val Value to set for the specified MIDI control change.
 * @return stm32synth_res_t STM32SYNTH_RES_OK if the configuration was successfully changed, STM32SYNTH_RES_NG otherwise.
 */
stm32synth_res_t stm32synth_drum_change_to_test(uint8_t _midiCC, uint8_t _val)
{
    stm32synth_res_t res = STM32SYNTH_RES_OK;

    switch (_midiCC)
    {
    case STM32SYNTH_MIDICC_USER_DRUM_NN:
        drumConfigList[0].nn = _val;
        break;

    case STM32SYNTH_MIDICC_USER_DRUM_TYPE:
        drumConfigList[0].waveformType = _val;
        break;

    case STM32SYNTH_MIDICC_USER_DRUM_LPF_FCNN:
        drumConfigList[0].lpffc_nn = (_val == 127) ? (STM32SYNTH_MIDINN_FILTER_DISABLE) : (_val);
        break;

    case STM32SYNTH_MIDICC_USER_DRUM_HPF_FCNN:
        drumConfigList[0].hpffc_nn = (_val == 0) ? (STM32SYNTH_MIDINN_FILTER_DISABLE) : (_val);
        break;

    case STM32SYNTH_MIDICC_USER_DRUM_LPF_Q:
        drumConfigList[0].lpfq = ((float32_t)_val / 127.0f) * 2.0f;
        break;

    case STM32SYNTH_MIDICC_USER_DRUM_HPF_Q:
        drumConfigList[0].hpfq = ((float32_t)_val / 127.0f) * 2.0f;
        break;

    default:
        break;
    }

    return res;
}

/**
 * @brief Initialize the drum configuration for test mode.
 *
 * @return stm32synth_res_t STM32SYNTH_RES_OK if the initialization was successful, STM32SYNTH_RES_NG otherwise.
 */
stm32synth_res_t stm32synth_drum_init()
{
    drumConfigList[0].waveformType = STM32SYNTH_CHORD_DRUM_TYPE_SIN | STM32SYNTH_CHORD_DRUM_TYPE_SQU | STM32SYNTH_CHORD_DRUM_TYPE_TRI | STM32SYNTH_CHORD_DRUM_TYPE_NOISE;
    return STM32SYNTH_RES_OK;
}
#endif /* STM32SYNTH_DRUM_TESTMODE */

#ifdef STM32SYNTH_DRUM_TESTMODE
static stm32synth_config_drum_t drumConfigList[STM32SYNTH_DRUMCHORD_NUMBER] = {
    {STM32SYNTH_MIDINN_D3, 0, STM32SYNTH_MIDINN_FILTER_DISABLE, STM32SYNTH_MIDINN_FILTER_DISABLE, STM32SYNTH_CHORD_DRUM_TYPE_SIN | STM32SYNTH_CHORD_DRUM_TYPE_SQU | STM32SYNTH_CHORD_DRUM_TYPE_TRI | STM32SYNTH_CHORD_DRUM_TYPE_NOISE, 128, 0.717, 0.717, 1, 0}, // NoteNum:34 Test
#else
static const stm32synth_config_drum_t drumConfigList[STM32SYNTH_DRUMCHORD_NUMBER] = {
#endif /* STM32SYNTH_DRUM_TESTMODE */
    // NN, PITCHforWave2, LPF_FCNN, HPF_FCNN, TYPE, DISTORTION, LPF_Q, HPF_Q, WN_Amp, freqenv_diff
    {STM32SYNTH_MIDINN_D3, 0, STM32SYNTH_MIDINN_FILTER_DISABLE, STM32SYNTH_MIDINN_FILTER_DISABLE, STM32SYNTH_CHORD_DRUM_TYPE_SIN, 110, 0.717, 0.717, 1, -11776},                 // NoteNum:35 Acoustic Bass Drum
    {STM32SYNTH_MIDINN_D3, 0, STM32SYNTH_MIDINN_FILTER_DISABLE, STM32SYNTH_MIDINN_FILTER_DISABLE, STM32SYNTH_CHORD_DRUM_TYPE_SIN, 110, 0.717, 0.717, 1, -11776},                 // NoteNum:36 Drum1
    {STM32SYNTH_MIDINN_G4, 0, STM32SYNTH_MIDINN_D7, STM32SYNTH_MIDINN_E7, STM32SYNTH_CHORD_DRUM_TYPE_TRI | STM32SYNTH_CHORD_DRUM_TYPE_NOISE, 128, 2, 2, 2, 0},                   // NoteNum:37 Side Stick
    {STM32SYNTH_MIDINN_F3, 1024, STM32SYNTH_MIDINN_C9, STM32SYNTH_MIDINN_A7, STM32SYNTH_CHORD_DRUM_TYPE_SQU | STM32SYNTH_CHORD_DRUM_TYPE_NOISE, 64, 2, 2, 0.5, 0},               // NoteNum:38 Acoustic Snare
    {STM32SYNTH_MIDINN_NONE, 0, STM32SYNTH_MIDINN_C6, STM32SYNTH_MIDINN_B5, STM32SYNTH_CHORD_DRUM_TYPE_NOISE, 128, 2, 2, 2, 0},                                                  // NoteNum:39 Hand Clap
    {STM32SYNTH_MIDINN_NONE, 0, STM32SYNTH_MIDINN_DS7, STM32SYNTH_MIDINN_G7, STM32SYNTH_CHORD_DRUM_TYPE_NOISE, 128, 2, 2, 2, 0},                                                 // NoteNum:40 Electric Snare
    {STM32SYNTH_MIDINN_E2, 0, STM32SYNTH_MIDINN_FILTER_DISABLE, STM32SYNTH_MIDINN_FILTER_DISABLE, STM32SYNTH_CHORD_DRUM_TYPE_SIN, 90, 2, 2, 1, -4864},                           // NoteNum:41 Low Floor Tom
    {STM32SYNTH_MIDINN_GS5, 572, STM32SYNTH_MIDINN_FS9, STM32SYNTH_MIDINN_D9, STM32SYNTH_CHORD_DRUM_TYPE_SQU | STM32SYNTH_CHORD_DRUM_TYPE_NOISE, 128, 2, 2, 0.5, 0},             // NoteNum:42 Closed Hi-Hat
    {STM32SYNTH_MIDINN_GS2, 0, STM32SYNTH_MIDINN_FILTER_DISABLE, STM32SYNTH_MIDINN_FILTER_DISABLE, STM32SYNTH_CHORD_DRUM_TYPE_SIN, 90, 2, 2, 1, -4864},                          // NoteNum:43 High Floor Tom
    {STM32SYNTH_MIDINN_GS5, 572, STM32SYNTH_MIDINN_FS9, STM32SYNTH_MIDINN_D9, STM32SYNTH_CHORD_DRUM_TYPE_SQU | STM32SYNTH_CHORD_DRUM_TYPE_NOISE, 128, 2, 2, 1, 0},               // NoteNum:44 Pedal Hi-Hat
    {STM32SYNTH_MIDINN_FS3, 0, STM32SYNTH_MIDINN_FILTER_DISABLE, STM32SYNTH_MIDINN_FILTER_DISABLE, STM32SYNTH_CHORD_DRUM_TYPE_SIN, 90, 2, 2, 1, -4864},                          // NoteNum:45 Low Tom
    {STM32SYNTH_MIDINN_GS5, 572, STM32SYNTH_MIDINN_FS9, STM32SYNTH_MIDINN_D9, STM32SYNTH_CHORD_DRUM_TYPE_SQU | STM32SYNTH_CHORD_DRUM_TYPE_NOISE, 128, 2, 2, 1.5, 0},             // NoteNum:46 Open Hi-Hat
    {STM32SYNTH_MIDINN_A2, 0, STM32SYNTH_MIDINN_FILTER_DISABLE, STM32SYNTH_MIDINN_FILTER_DISABLE, STM32SYNTH_CHORD_DRUM_TYPE_TRI, 90, 2, 2, 1, -4864},                           // NoteNum:47 Low Mid Tom
    {STM32SYNTH_MIDINN_D3, 0, STM32SYNTH_MIDINN_FILTER_DISABLE, STM32SYNTH_MIDINN_FILTER_DISABLE, STM32SYNTH_CHORD_DRUM_TYPE_TRI, 90, 2, 2, 1, -4864},                           // NoteNum:48 Hi Mid Tom
    {STM32SYNTH_MIDINN_C3, 80, STM32SYNTH_MIDINN_E9, STM32SYNTH_MIDINN_AS6, STM32SYNTH_CHORD_DRUM_TYPE_SQU | STM32SYNTH_CHORD_DRUM_TYPE_NOISE, 77, 2, 1.5, 2, 0},                // NoteNum:49 Crash Cymbal1
    {STM32SYNTH_MIDINN_AS3, 0, STM32SYNTH_MIDINN_FILTER_DISABLE, STM32SYNTH_MIDINN_FILTER_DISABLE, STM32SYNTH_CHORD_DRUM_TYPE_SIN, 90, 2, 2, 1, -4864},                          // NoteNum:50 High Tom
    {STM32SYNTH_MIDINN_GS5, 572, STM32SYNTH_MIDINN_FILTER_DISABLE, STM32SYNTH_MIDINN_DS8, STM32SYNTH_CHORD_DRUM_TYPE_SQU | STM32SYNTH_CHORD_DRUM_TYPE_NOISE, 128, 2, 2, 0.5, 0}, // NoteNum:51 Ride Cymbal1
    {STM32SYNTH_MIDINN_AS4, 0, STM32SYNTH_MIDINN_FILTER_DISABLE, STM32SYNTH_MIDINN_E7, STM32SYNTH_CHORD_DRUM_TYPE_SQU | STM32SYNTH_CHORD_DRUM_TYPE_NOISE, 128, 2, 2, 1, 0},      // NoteNum:52 Chinese Cymbal
    {STM32SYNTH_MIDINN_AS5, 0, STM32SYNTH_MIDINN_FILTER_DISABLE, STM32SYNTH_MIDINN_G8, STM32SYNTH_CHORD_DRUM_TYPE_SQU | STM32SYNTH_CHORD_DRUM_TYPE_NOISE, 128, 2, 2, 1, 0},      // NoteNum:53 Ride Bell
    {STM32SYNTH_MIDINN_NONE, 0, STM32SYNTH_MIDINN_FILTER_DISABLE, STM32SYNTH_MIDINN_E9, STM32SYNTH_CHORD_DRUM_TYPE_NOISE, 128, 2, 2, 1, 0},                                      // NoteNum:54 Tambourine
    {STM32SYNTH_MIDINN_NONE, 0, STM32SYNTH_MIDINN_FILTER_DISABLE, STM32SYNTH_MIDINN_G6, STM32SYNTH_CHORD_DRUM_TYPE_NOISE, 128, 2, 2, 1, 0},                                      // NoteNum:55 Splash Cymbal
    {STM32SYNTH_MIDINN_GS3, 1024, STM32SYNTH_MIDINN_CS6, STM32SYNTH_MIDINN_CS6, STM32SYNTH_CHORD_DRUM_TYPE_SQU, 128, 2, 2, 1, 0},                                                // NoteNum:56 Cowbell
    {STM32SYNTH_MIDINN_D3, 80, STM32SYNTH_MIDINN_E9, STM32SYNTH_MIDINN_AS6, STM32SYNTH_CHORD_DRUM_TYPE_SQU | STM32SYNTH_CHORD_DRUM_TYPE_NOISE, 77, 2, 1.5, 2, 0},                // NoteNum:57 Crash Cymbal2
    {STM32SYNTH_MIDINN_GS3, 1024, STM32SYNTH_MIDINN_CS6, STM32SYNTH_MIDINN_CS6, STM32SYNTH_CHORD_DRUM_TYPE_SQU, 128, 2, 2, 1, 0},                                                // NoteNum:58 Vibraslap
    {STM32SYNTH_MIDINN_AS5, 572, STM32SYNTH_MIDINN_FILTER_DISABLE, STM32SYNTH_MIDINN_DS8, STM32SYNTH_CHORD_DRUM_TYPE_SQU | STM32SYNTH_CHORD_DRUM_TYPE_NOISE, 128, 2, 2, 0.5, 0}, // NoteNum:59 Ride Cymbal2
    {STM32SYNTH_MIDINN_E4, 0, STM32SYNTH_MIDINN_FILTER_DISABLE, STM32SYNTH_MIDINN_FILTER_DISABLE, STM32SYNTH_CHORD_DRUM_TYPE_SIN, 128, 0.717, 0.717, 1, 0},                      // NoteNum:60 Hi Bongo
    {STM32SYNTH_MIDINN_E3, 0, STM32SYNTH_MIDINN_FILTER_DISABLE, STM32SYNTH_MIDINN_FILTER_DISABLE, STM32SYNTH_CHORD_DRUM_TYPE_SIN, 128, 0.717, 0.717, 1, 0},                      // NoteNum:61 Low Bongo
    {STM32SYNTH_MIDINN_E4, 0, STM32SYNTH_MIDINN_FILTER_DISABLE, STM32SYNTH_MIDINN_FILTER_DISABLE, STM32SYNTH_CHORD_DRUM_TYPE_SIN, 128, 0.717, 0.717, 1, 0},                      // NoteNum:62 Mute Hi Conga
    {STM32SYNTH_MIDINN_E5, 0, STM32SYNTH_MIDINN_FILTER_DISABLE, STM32SYNTH_MIDINN_FILTER_DISABLE, STM32SYNTH_CHORD_DRUM_TYPE_SIN, 128, 0.717, 0.717, 1, 0},                      // NoteNum:63 Open Hi Conga
    {STM32SYNTH_MIDINN_D4, 0, STM32SYNTH_MIDINN_FILTER_DISABLE, STM32SYNTH_MIDINN_FILTER_DISABLE, STM32SYNTH_CHORD_DRUM_TYPE_SIN, 128, 0.717, 0.717, 1, 0},                      // NoteNum:64 Low Conga
    {STM32SYNTH_MIDINN_DS4, 0, STM32SYNTH_MIDINN_FILTER_DISABLE, STM32SYNTH_MIDINN_FILTER_DISABLE, STM32SYNTH_CHORD_DRUM_TYPE_SIN, 128, 0.717, 0.717, 1, 0},                     // NoteNum:65 High Timbale
    {STM32SYNTH_MIDINN_C3, 0, STM32SYNTH_MIDINN_FILTER_DISABLE, STM32SYNTH_MIDINN_FILTER_DISABLE, STM32SYNTH_CHORD_DRUM_TYPE_SIN, 128, 0.717, 0.717, 1, 0},                      // NoteNum:66 Low Timbale
    {STM32SYNTH_MIDINN_CS8, 0, STM32SYNTH_MIDINN_FILTER_DISABLE, STM32SYNTH_MIDINN_FILTER_DISABLE, STM32SYNTH_CHORD_DRUM_TYPE_SIN, 128, 0.717, 0.717, 1, 0},                     // NoteNum:67 High Agogo
    {STM32SYNTH_MIDINN_B6, 0, STM32SYNTH_MIDINN_FILTER_DISABLE, STM32SYNTH_MIDINN_FILTER_DISABLE, STM32SYNTH_CHORD_DRUM_TYPE_SIN, 128, 0.717, 0.717, 1, 0},                      // NoteNum:68 Low Agogo
    {STM32SYNTH_MIDINN_NONE, 0, STM32SYNTH_MIDINN_FILTER_DISABLE, STM32SYNTH_MIDINN_AS5, STM32SYNTH_CHORD_DRUM_TYPE_NOISE, 128, 0.717, 0.717, 1, 0},                             // NoteNum:69 Cabassa
    {STM32SYNTH_MIDINN_NONE, 0, STM32SYNTH_MIDINN_FILTER_DISABLE, STM32SYNTH_MIDINN_FILTER_DISABLE, STM32SYNTH_CHORD_DRUM_TYPE_NOISE, 128, 0.717, 2, 1, 0},                      // NoteNum:70 Maracas
    {STM32SYNTH_MIDINN_NONE, 0, STM32SYNTH_MIDINN_FILTER_DISABLE, STM32SYNTH_MIDINN_FILTER_DISABLE, STM32SYNTH_CHORD_DRUM_TYPE_NOISE, 128, 0.717, 0.717, 1, 0},                  // NoteNum:71 Short Whiatle
    {STM32SYNTH_MIDINN_NONE, 0, STM32SYNTH_MIDINN_FILTER_DISABLE, STM32SYNTH_MIDINN_FILTER_DISABLE, STM32SYNTH_CHORD_DRUM_TYPE_NOISE, 128, 0.717, 0.717, 1, 0},                  // NoteNum:72 Long Whistle
    {STM32SYNTH_MIDINN_NONE, 0, STM32SYNTH_MIDINN_FILTER_DISABLE, STM32SYNTH_MIDINN_FILTER_DISABLE, STM32SYNTH_CHORD_DRUM_TYPE_NOISE, 128, 0.717, 0.717, 1, 0},                  // NoteNum:73 Short Guiro
    {STM32SYNTH_MIDINN_NONE, 0, STM32SYNTH_MIDINN_FILTER_DISABLE, STM32SYNTH_MIDINN_FILTER_DISABLE, STM32SYNTH_CHORD_DRUM_TYPE_NOISE, 128, 0.717, 0.717, 1, 0},                  // NoteNum:74 Long Guiro
    {STM32SYNTH_MIDINN_NONE, 0, STM32SYNTH_MIDINN_FILTER_DISABLE, STM32SYNTH_MIDINN_FILTER_DISABLE, STM32SYNTH_CHORD_DRUM_TYPE_NOISE, 128, 0.717, 0.717, 1, 0},                  // NoteNum:75 Claves
    {STM32SYNTH_MIDINN_NONE, 0, STM32SYNTH_MIDINN_FILTER_DISABLE, STM32SYNTH_MIDINN_FILTER_DISABLE, STM32SYNTH_CHORD_DRUM_TYPE_NOISE, 128, 0.717, 0.717, 1, 0},                  // NoteNum:76 Hi Wood Block
    {STM32SYNTH_MIDINN_NONE, 0, STM32SYNTH_MIDINN_FILTER_DISABLE, STM32SYNTH_MIDINN_FILTER_DISABLE, STM32SYNTH_CHORD_DRUM_TYPE_NOISE, 128, 0.717, 0.717, 1, 0},                  // NoteNum:77 Low Wood Block
    {STM32SYNTH_MIDINN_NONE, 0, STM32SYNTH_MIDINN_FILTER_DISABLE, STM32SYNTH_MIDINN_FILTER_DISABLE, STM32SYNTH_CHORD_DRUM_TYPE_NOISE, 128, 0.717, 0.717, 1, 0},                  // NoteNum:78 Mute Cuica
    {STM32SYNTH_MIDINN_NONE, 0, STM32SYNTH_MIDINN_FILTER_DISABLE, STM32SYNTH_MIDINN_FILTER_DISABLE, STM32SYNTH_CHORD_DRUM_TYPE_NOISE, 128, 0.717, 0.717, 1, 0},                  // NoteNum:79 Open Cuica
    {STM32SYNTH_MIDINN_NONE, 0, STM32SYNTH_MIDINN_FILTER_DISABLE, STM32SYNTH_MIDINN_FILTER_DISABLE, STM32SYNTH_CHORD_DRUM_TYPE_NOISE, 128, 0.717, 0.717, 1, 0},                  // NoteNum:80 Mute Triangle
    {STM32SYNTH_MIDINN_NONE, 0, STM32SYNTH_MIDINN_FILTER_DISABLE, STM32SYNTH_MIDINN_FILTER_DISABLE, STM32SYNTH_CHORD_DRUM_TYPE_NOISE, 128, 0.717, 0.717, 1, 0},                  // NoteNum:81 Open Triangle
};

