k-omura/STM32-synthesizer/Drivers/stm32_synth/components/stm32_synth_chord.c
#ifndef STM32SYNTH_SIN_CORDIC
static const q15_t sine_lut[1024] = {
    0x0000, 0x00C9, 0x0192, 0x025B, 0x0324, 0x03ED, 0x04B6, 0x057F,
    0x0648, 0x0711, 0x07D9, 0x08A2, 0x096A, 0x0A33, 0x0AFB, 0x0BC4,
    0x0C8C, 0x0D54, 0x0E1C, 0x0EE3, 0x0FAB, 0x1072, 0x113A, 0x1201,
    0x12C8, 0x138F, 0x1455, 0x151C, 0x15E2, 0x16A8, 0x176E, 0x1833,
    0x18F9, 0x19BE, 0x1A82, 0x1B47, 0x1C0B, 0x1CCF, 0x1D93, 0x1E57,
    0x1F1A, 0x1FDD, 0x209F, 0x2161, 0x2223, 0x22E5, 0x23A6, 0x2467,
    0x2528, 0x25E8, 0x26A8, 0x2767, 0x2826, 0x28E5, 0x29A3, 0x2A61,
    0x2B1F, 0x2BDC, 0x2C99, 0x2D55, 0x2E11, 0x2ECC, 0x2F87, 0x3041,
    0x30FB, 0x31B5, 0x326E, 0x3326, 0x33DF, 0x3496, 0x354D, 0x3604,
    0x36BA, 0x376F, 0x3824, 0x38D9, 0x398C, 0x3A40, 0x3AF2, 0x3BA5,
    0x3C56, 0x3D07, 0x3DB8, 0x3E68, 0x3F17, 0x3FC5, 0x4073, 0x4121,
    0x41CE, 0x427A, 0x4325, 0x43D0, 0x447A, 0x4524, 0x45CD, 0x4675,
    0x471C, 0x47C3, 0x4869, 0x490F, 0x49B4, 0x4A58, 0x4AFB, 0x4B9D,
    0x4C3F, 0x4CE0, 0x4D81, 0x4E20, 0x4EBF, 0x4F5D, 0x4FFB, 0x5097,
    0x5133, 0x51CE, 0x5268, 0x5302, 0x539B, 0x5432, 0x54C9, 0x5560,
    0x55F5, 0x568A, 0x571D, 0x57B0, 0x5842, 0x58D3, 0x5964, 0x59F3,
    0x5A82, 0x5B0F, 0x5B9C, 0x5C28, 0x5CB3, 0x5D3E, 0x5DC7, 0x5E4F,
    0x5ED7, 0x5F5D, 0x5FE3, 0x6068, 0x60EB, 0x616E, 0x61F0, 0x6271,
    0x62F1, 0x6370, 0x63EE, 0x646C, 0x64E8, 0x6563, 0x65DD, 0x6656,
    0x66CF, 0x6746, 0x67BC, 0x6832, 0x68A6, 0x6919, 0x698B, 0x69FD,
    0x6A6D, 0x6ADC, 0x6B4A, 0x6BB7, 0x6C23, 0x6C8E, 0x6CF8, 0x6D61,
    0x6DC9, 0x6E30, 0x6E96, 0x6EFB, 0x6F5E, 0x6FC1, 0x7022, 0x7083,
    0x70E2, 0x7140, 0x719D, 0x71F9, 0x7254, 0x72AE, 0x7307, 0x735E,
    0x73B5, 0x740A, 0x745F, 0x74B2, 0x7504, 0x7555, 0x75A5, 0x75F3,
    0x7641, 0x768D, 0x76D8, 0x7722, 0x776B, 0x77B3, 0x77FA, 0x783F,
    0x7884, 0x78C7, 0x7909, 0x794A, 0x7989, 0x79C8, 0x7A05, 0x7A41,
    0x7A7C, 0x7AB6, 0x7AEE, 0x7B26, 0x7B5C, 0x7B91, 0x7BC5, 0x7BF8,
    0x7C29, 0x7C59, 0x7C88, 0x7CB6, 0x7CE3, 0x7D0E, 0x7D39, 0x7D62,
    0x7D89, 0x7DB0, 0x7DD5, 0x7DFA, 0x7E1D, 0x7E3E, 0x7E5F, 0x7E7E,
    0x7E9C, 0x7EB9, 0x7ED5, 0x7EEF, 0x7F09, 0x7F21, 0x7F37, 0x7F4D,
    0x7F61, 0x7F74, 0x7F86, 0x7F97, 0x7FA6, 0x7FB4, 0x7FC1, 0x7FCD,
    0x7FD8, 0x7FE1, 0x7FE9, 0x7FF0, 0x7FF5, 0x7FF9, 0x7FFD, 0x7FFE,
    0x7FFF, 0x7FFE, 0x7FFD, 0x7FF9, 0x7FF5, 0x7FF0, 0x7FE9, 0x7FE1,
    0x7FD8, 0x7FCD, 0x7FC1, 0x7FB4, 0x7FA6, 0x7F97, 0x7F86, 0x7F74,
    0x7F61, 0x7F4D, 0x7F37, 0x7F21, 0x7F09, 0x7EEF, 0x7ED5, 0x7EB9,
    0x7E9C, 0x7E7E, 0x7E5F, 0x7E3E, 0x7E1D, 0x7DFA, 0x7DD5, 0x7DB0,
    0x7D89, 0x7D62, 0x7D39, 0x7D0E, 0x7CE3, 0x7CB6, 0x7C88, 0x7C59,
    0x7C29, 0x7BF8, 0x7BC5, 0x7B91, 0x7B5C, 0x7B26, 0x7AEE, 0x7AB6,
    0x7A7C, 0x7A41, 0x7A05, 0x79C8, 0x7989, 0x794A, 0x7909, 0x78C7,
    0x7884, 0x783F, 0x77FA, 0x77B3, 0x776B, 0x7722, 0x76D8, 0x768D,
    0x7641, 0x75F3, 0x75A5, 0x7555, 0x7504, 0x74B2, 0x745F, 0x740A,
    0x73B5, 0x735E, 0x7307, 0x72AE, 0x7254, 0x71F9, 0x719D, 0x7140,
    0x70E2, 0x7083, 0x7022, 0x6FC1, 0x6F5E, 0x6EFB, 0x6E96, 0x6E30,
    0x6DC9, 0x6D61, 0x6CF8, 0x6C8E, 0x6C23, 0x6BB7, 0x6B4A, 0x6ADC,
    0x6A6D, 0x69FD, 0x698B, 0x6919, 0x68A6, 0x6832, 0x67BC, 0x6746,
    0x66CF, 0x6656, 0x65DD, 0x6563, 0x64E8, 0x646C, 0x63EE, 0x6370,
    0x62F1, 0x6271, 0x61F0, 0x616E, 0x60EB, 0x6068, 0x5FE3, 0x5F5D,
    0x5ED7, 0x5E4F, 0x5DC7, 0x5D3E, 0x5CB3, 0x5C28, 0x5B9C, 0x5B0F,
    0x5A82, 0x59F3, 0x5964, 0x58D3, 0x5842, 0x57B0, 0x571D, 0x568A,
    0x55F5, 0x5560, 0x54C9, 0x5432, 0x539B, 0x5302, 0x5268, 0x51CE,
    0x5133, 0x5097, 0x4FFB, 0x4F5D, 0x4EBF, 0x4E20, 0x4D81, 0x4CE0,
    0x4C3F, 0x4B9D, 0x4AFB, 0x4A58, 0x49B4, 0x490F, 0x4869, 0x47C3,
    0x471C, 0x4675, 0x45CD, 0x4524, 0x447A, 0x43D0, 0x4325, 0x427A,
    0x41CE, 0x4121, 0x4073, 0x3FC5, 0x3F17, 0x3E68, 0x3DB8, 0x3D07,
    0x3C56, 0x3BA5, 0x3AF2, 0x3A40, 0x398C, 0x38D9, 0x3824, 0x376F,
    0x36BA, 0x3604, 0x354D, 0x3496, 0x33DF, 0x3326, 0x326E, 0x31B5,
    0x30FB, 0x3041, 0x2F87, 0x2ECC, 0x2E11, 0x2D55, 0x2C99, 0x2BDC,
    0x2B1F, 0x2A61, 0x29A3, 0x28E5, 0x2826, 0x2767, 0x26A8, 0x25E8,
    0x2528, 0x2467, 0x23A6, 0x22E5, 0x2223, 0x2161, 0x209F, 0x1FDD,
    0x1F1A, 0x1E57, 0x1D93, 0x1CCF, 0x1C0B, 0x1B47, 0x1A82, 0x19BE,
    0x18F9, 0x1833, 0x176E, 0x16A8, 0x15E2, 0x151C, 0x1455, 0x138F,
    0x12C8, 0x1201, 0x113A, 0x1072, 0x0FAB, 0x0EE3, 0x0E1C, 0x0D54,
    0x0C8C, 0x0BC4, 0x0AFB, 0x0A33, 0x096A, 0x08A2, 0x07D9, 0x0711,
    0x0648, 0x057F, 0x04B6, 0x03ED, 0x0324, 0x025B, 0x0192, 0x00C9,
    0x0000, -0x00C9, -0x0192, -0x025B, -0x0324, -0x03ED, -0x04B6, -0x057F,
    -0x0648, -0x0711, -0x07D9, -0x08A2, -0x096A, -0x0A33, -0x0AFB, -0x0BC4,
    -0x0C8C, -0x0D54, -0x0E1C, -0x0EE3, -0x0FAB, -0x1072, -0x113A, -0x1201,
    -0x12C8, -0x138F, -0x1455, -0x151C, -0x15E2, -0x16A8, -0x176E, -0x1833,
    -0x18F9, -0x19BE, -0x1A82, -0x1B47, -0x1C0B, -0x1CCF, -0x1D93, -0x1E57,
    -0x1F1A, -0x1FDD, -0x209F, -0x2161, -0x2223, -0x22E5, -0x23A6, -0x2467,
    -0x2528, -0x25E8, -0x26A8, -0x2767, -0x2826, -0x28E5, -0x29A3, -0x2A61,
    -0x2B1F, -0x2BDC, -0x2C99, -0x2D55, -0x2E11, -0x2ECC, -0x2F87, -0x3041,
    -0x30FB, -0x31B5, -0x326E, -0x3326, -0x33DF, -0x3496, -0x354D, -0x3604,
    -0x36BA, -0x376F, -0x3824, -0x38D9, -0x398C, -0x3A40, -0x3AF2, -0x3BA5,
    -0x3C56, -0x3D07, -0x3DB8, -0x3E68, -0x3F17, -0x3FC5, -0x4073, -0x4121,
    -0x41CE, -0x427A, -0x4325, -0x43D0, -0x447A, -0x4524, -0x45CD, -0x4675,
    -0x471C, -0x47C3, -0x4869, -0x490F, -0x49B4, -0x4A58, -0x4AFB, -0x4B9D,
    -0x4C3F, -0x4CE0, -0x4D81, -0x4E20, -0x4EBF, -0x4F5D, -0x4FFB, -0x5097,
    -0x5133, -0x51CE, -0x5268, -0x5302, -0x539B, -0x5432, -0x54C9, -0x5560,
    -0x55F5, -0x568A, -0x571D, -0x57B0, -0x5842, -0x58D3, -0x5964, -0x59F3,
    -0x5A82, -0x5B0F, -0x5B9C, -0x5C28, -0x5CB3, -0x5D3E, -0x5DC7, -0x5E4F,
    -0x5ED7, -0x5F5D, -0x5FE3, -0x6068, -0x60EB, -0x616E, -0x61F0, -0x6271,
    -0x62F1, -0x6370, -0x63EE, -0x646C, -0x64E8, -0x6563, -0x65DD, -0x6656,
    -0x66CF, -0x6746, -0x67BC, -0x6832, -0x68A6, -0x6919, -0x698B, -0x69FD,
    -0x6A6D, -0x6ADC, -0x6B4A, -0x6BB7, -0x6C23, -0x6C8E, -0x6CF8, -0x6D61,
    -0x6DC9, -0x6E30, -0x6E96, -0x6EFB, -0x6F5E, -0x6FC1, -0x7022, -0x7083,
    -0x70E2, -0x7140, -0x719D, -0x71F9, -0x7254, -0x72AE, -0x7307, -0x735E,
    -0x73B5, -0x740A, -0x745F, -0x74B2, -0x7504, -0x7555, -0x75A5, -0x75F3,
    -0x7641, -0x768D, -0x76D8, -0x7722, -0x776B, -0x77B3, -0x77FA, -0x783F,
    -0x7884, -0x78C7, -0x7909, -0x794A, -0x7989, -0x79C8, -0x7A05, -0x7A41,
    -0x7A7C, -0x7AB6, -0x7AEE, -0x7B26, -0x7B5C, -0x7B91, -0x7BC5, -0x7BF8,
    -0x7C29, -0x7C59, -0x7C88, -0x7CB6, -0x7CE3, -0x7D0E, -0x7D39, -0x7D62,
    -0x7D89, -0x7DB0, -0x7DD5, -0x7DFA, -0x7E1D, -0x7E3E, -0x7E5F, -0x7E7E,
    -0x7E9C, -0x7EB9, -0x7ED5, -0x7EEF, -0x7F09, -0x7F21, -0x7F37, -0x7F4D,
    -0x7F61, -0x7F74, -0x7F86, -0x7F97, -0x7FA6, -0x7FB4, -0x7FC1, -0x7FCD,
    -0x7FD8, -0x7FE1, -0x7FE9, -0x7FF0, -0x7FF5, -0x7FF9, -0x7FFD, -0x7FFE,
    -0x7FFF, -0x7FFE, -0x7FFD, -0x7FF9, -0x7FF5, -0x7FF0, -0x7FE9, -0x7FE1,
    -0x7FD8, -0x7FCD, -0x7FC1, -0x7FB4, -0x7FA6, -0x7F97, -0x7F86, -0x7F74,
    -0x7F61, -0x7F4D, -0x7F37, -0x7F21, -0x7F09, -0x7EEF, -0x7ED5, -0x7EB9,
    -0x7E9C, -0x7E7E, -0x7E5F, -0x7E3E, -0x7E1D, -0x7DFA, -0x7DD5, -0x7DB0,
    -0x7D89, -0x7D62, -0x7D39, -0x7D0E, -0x7CE3, -0x7CB6, -0x7C88, -0x7C59,
    -0x7C29, -0x7BF8, -0x7BC5, -0x7B91, -0x7B5C, -0x7B26, -0x7AEE, -0x7AB6,
    -0x7A7C, -0x7A41, -0x7A05, -0x79C8, -0x7989, -0x794A, -0x7909, -0x78C7,
    -0x7884, -0x783F, -0x77FA, -0x77B3, -0x776B, -0x7722, -0x76D8, -0x768D,
    -0x7641, -0x75F3, -0x75A5, -0x7555, -0x7504, -0x74B2, -0x745F, -0x740A,
    -0x73B5, -0x735E, -0x7307, -0x72AE, -0x7254, -0x71F9, -0x719D, -0x7140,
    -0x70E2, -0x7083, -0x7022, -0x6FC1, -0x6F5E, -0x6EFB, -0x6E96, -0x6E30,
    -0x6DC9, -0x6D61, -0x6CF8, -0x6C8E, -0x6C23, -0x6BB7, -0x6B4A, -0x6ADC,
    -0x6A6D, -0x69FD, -0x698B, -0x6919, -0x68A6, -0x6832, -0x67BC, -0x6746,
    -0x66CF, -0x6656, -0x65DD, -0x6563, -0x64E8, -0x646C, -0x63EE, -0x6370,
    -0x62F1, -0x6271, -0x61F0, -0x616E, -0x60EB, -0x6068, -0x5FE3, -0x5F5D,
    -0x5ED7, -0x5E4F, -0x5DC7, -0x5D3E, -0x5CB3, -0x5C28, -0x5B9C, -0x5B0F,
    -0x5A82, -0x59F3, -0x5964, -0x58D3, -0x5842, -0x57B0, -0x571D, -0x568A,
    -0x55F5, -0x5560, -0x54C9, -0x5432, -0x539B, -0x5302, -0x5268, -0x51CE,
    -0x5133, -0x5097, -0x4FFB, -0x4F5D, -0x4EBF, -0x4E20, -0x4D81, -0x4CE0,
    -0x4C3F, -0x4B9D, -0x4AFB, -0x4A58, -0x49B4, -0x490F, -0x4869, -0x47C3,
    -0x471C, -0x4675, -0x45CD, -0x4524, -0x447A, -0x43D0, -0x4325, -0x427A,
    -0x41CE, -0x4121, -0x4073, -0x3FC5, -0x3F17, -0x3E68, -0x3DB8, -0x3D07,
    -0x3C56, -0x3BA5, -0x3AF2, -0x3A40, -0x398C, -0x38D9, -0x3824, -0x376F,
    -0x36BA, -0x3604, -0x354D, -0x3496, -0x33DF, -0x3326, -0x326E, -0x31B5,
    -0x30FB, -0x3041, -0x2F87, -0x2ECC, -0x2E11, -0x2D55, -0x2C99, -0x2BDC,
    -0x2B1F, -0x2A61, -0x29A3, -0x28E5, -0x2826, -0x2767, -0x26A8, -0x25E8,
    -0x2528, -0x2467, -0x23A6, -0x22E5, -0x2223, -0x2161, -0x209F, -0x1FDD,
    -0x1F1A, -0x1E57, -0x1D93, -0x1CCF, -0x1C0B, -0x1B47, -0x1A82, -0x19BE,
    -0x18F9, -0x1833, -0x176E, -0x16A8, -0x15E2, -0x151C, -0x1455, -0x138F,
    -0x12C8, -0x1201, -0x113A, -0x1072, -0x0FAB, -0x0EE3, -0x0E1C, -0x0D54,
    -0x0C8C, -0x0BC4, -0x0AFB, -0x0A33, -0x096A, -0x08A2, -0x07D9, -0x0711,
    -0x0648, -0x057F, -0x04B6, -0x03ED, -0x0324, -0x025B, -0x0192, -0x00C9};
#endif /* STM32SYNTH_SIN_CORDIC */

static const float32_t exp_neg2_table[257] = {
    1.00000000, 0.99221794, 0.98449644, 0.97683502, 0.96923323, 0.96169060, 0.95420667, 0.94678097,
    0.93941306, 0.93210249, 0.92484881, 0.91765158, 0.91051036, 0.90342471, 0.89639421, 0.88941841,
    0.88249690, 0.87562926, 0.86881506, 0.86205388, 0.85534533, 0.84868898, 0.84208443, 0.83553127,
    0.82902912, 0.82257756, 0.81617621, 0.80982468, 0.80352257, 0.79726951, 0.79106511, 0.78490899,
    0.77880078, 0.77274011, 0.76672660, 0.76075988, 0.75483960, 0.74896539, 0.74313690, 0.73735376,
    0.73161563, 0.72592215, 0.72027298, 0.71466777, 0.70910618, 0.70358787, 0.69811251, 0.69267976,
    0.68728928, 0.68194075, 0.67663385, 0.67136824, 0.66614361, 0.66095964, 0.65581601, 0.65071241,
    0.64564853, 0.64062405, 0.63563867, 0.63069209, 0.62578401, 0.62091412, 0.61608213, 0.61128774,
    0.60653066, 0.60181060, 0.59712727, 0.59248039, 0.58786967, 0.58329484, 0.57875560, 0.57425169,
    0.56978282, 0.56534874, 0.56094916, 0.55658382, 0.55225245, 0.54795479, 0.54369057, 0.53945954,
    0.53526143, 0.53109599, 0.52696297, 0.52286211, 0.51879317, 0.51475589, 0.51075002, 0.50677533,
    0.50283158, 0.49891851, 0.49503590, 0.49118350, 0.48736108, 0.48356840, 0.47980524, 0.47607137,
    0.47236655, 0.46869057, 0.46504319, 0.46142419, 0.45783336, 0.45427047, 0.45073531, 0.44722766,
    0.44374731, 0.44029404, 0.43686765, 0.43346791, 0.43009464, 0.42674762, 0.42342664, 0.42013151,
    0.41686202, 0.41361797, 0.41039917, 0.40720542, 0.40403652, 0.40089229, 0.39777252, 0.39467703,
    0.39160563, 0.38855813, 0.38553434, 0.38253409, 0.37955719, 0.37660345, 0.37367270, 0.37076476,
    0.36787944, 0.36501658, 0.36217600, 0.35935752, 0.35656098, 0.35378620, 0.35103302, 0.34830125,
    0.34559075, 0.34290134, 0.34023286, 0.33758515, 0.33495804, 0.33235138, 0.32976500, 0.32719875,
    0.32465247, 0.32212600, 0.31961920, 0.31713190, 0.31466396, 0.31221523, 0.30978555, 0.30737478,
    0.30498277, 0.30260937, 0.30025445, 0.29791785, 0.29559944, 0.29329906, 0.29101659, 0.28875188,
    0.28650480, 0.28427520, 0.28206295, 0.27986792, 0.27768997, 0.27552897, 0.27338479, 0.27125729,
    0.26914635, 0.26705184, 0.26497362, 0.26291158, 0.26086559, 0.25883551, 0.25682124, 0.25482264,
    0.25283960, 0.25087198, 0.24891968, 0.24698257, 0.24506054, 0.24315346, 0.24126123, 0.23938372,
    0.23752082, 0.23567242, 0.23383840, 0.23201866, 0.23021307, 0.22842154, 0.22664395, 0.22488019,
    0.22313016, 0.22139375, 0.21967085, 0.21796136, 0.21626517, 0.21458218, 0.21291229, 0.21125539,
    0.20961139, 0.20798018, 0.20636166, 0.20475574, 0.20316232, 0.20158130, 0.20001258, 0.19845607,
    0.19691168, 0.19537930, 0.19385884, 0.19235022, 0.19085334, 0.18936811, 0.18789443, 0.18643223,
    0.18498140, 0.18354186, 0.18211353, 0.18069631, 0.17929012, 0.17789487, 0.17651048, 0.17513687,
    0.17377394, 0.17242162, 0.17107983, 0.16974847, 0.16842748, 0.16711677, 0.16581626, 0.16452586,
    0.16324551, 0.16197513, 0.16071463, 0.15946393, 0.15822298, 0.15699168, 0.15576996, 0.15455774,
    0.15335497, 0.15216155, 0.15097742, 0.14980250, 0.14863673, 0.14748003, 0.14633233, 0.14519356,
    0.14406366, 0.14294255, 0.14183016, 0.14072643, 0.13963129, 0.13854467, 0.13746650, 0.13639673,
    0.13533528};
